benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-run3.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.254ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  769.26us  15.48ms   72.46%
    Req/Sec    67.10k     6.43k   86.11k    59.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.16ms
 75.000%    1.72ms
 90.000%    2.32ms
 99.000%    3.14ms
 99.900%    7.39ms
 99.990%   13.65ms
 99.999%   14.90ms
100.000%   15.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.468     0.100000       125803         1.11
       0.629     0.200000       250443         1.25
       0.789     0.300000       376205         1.43
       0.966     0.400000       501421         1.67
       1.163     0.500000       625990         2.00
       1.270     0.550000       688793         2.22
       1.375     0.600000       751409         2.50
       1.482     0.650000       814062         2.86
       1.597     0.700000       876477         3.33
       1.721     0.750000       939274         4.00
       1.787     0.775000       970648         4.44
       1.859     0.800000      1001885         5.00
       1.943     0.825000      1033091         5.71
       2.045     0.850000      1064144         6.67
       2.171     0.875000      1095412         8.00
       2.241     0.887500      1111103         8.89
       2.319     0.900000      1127092        10.00
       2.399     0.912500      1142523        11.43
       2.485     0.925000      1158322        13.33
       2.569     0.937500      1173705        16.00
       2.615     0.943750      1181777        17.78
       2.663     0.950000      1189571        20.00
       2.713     0.956250      1197308        22.86
       2.769     0.962500      1205130        26.67
       2.829     0.968750      1212780        32.00
       2.863     0.971875      1216752        35.56
       2.899     0.975000      1220612        40.00
       2.937     0.978125      1224583        45.71
       2.981     0.981250      1228520        53.33
       3.031     0.984375      1232479        64.00
       3.055     0.985938      1234297        71.11
       3.085     0.987500      1236305        80.00
       3.119     0.989062      1238237        91.43
       3.157     0.990625      1240252       106.67
       3.195     0.992188      1242153       128.00
       3.217     0.992969      1243114       142.22
       3.243     0.993750      1244136       160.00
       3.269     0.994531      1245121       182.86
       3.299     0.995313      1246045       213.33
       3.337     0.996094      1247014       256.00
       3.363     0.996484      1247502       284.44
       3.393     0.996875      1247995       320.00
       3.429     0.997266      1248491       365.71
       3.497     0.997656      1248978       426.67
       3.941     0.998047      1249454       512.00
       4.691     0.998242      1249700       568.89
       5.387     0.998437      1249943       640.00
       6.115     0.998633      1250190       731.43
       6.835     0.998828      1250433       853.33
       7.503     0.999023      1250682      1024.00
       7.747     0.999121      1250799      1137.78
       8.027     0.999219      1250921      1280.00
       8.351     0.999316      1251046      1462.86
       8.703     0.999414      1251166      1706.67
       9.567     0.999512      1251289      2048.00
       9.991     0.999561      1251349      2275.56
      10.255     0.999609      1251411      2560.00
      10.591     0.999658      1251472      2925.71
      11.159     0.999707      1251533      3413.33
      11.743     0.999756      1251594      4096.00
      12.047     0.999780      1251624      4551.11
      12.359     0.999805      1251655      5120.00
      12.679     0.999829      1251686      5851.43
      13.039     0.999854      1251716      6826.67
      13.295     0.999878      1251747      8192.00
      13.535     0.999890      1251762      9102.22
      13.671     0.999902      1251777     10240.00
      13.839     0.999915      1251793     11702.86
      13.991     0.999927      1251811     13653.33
      14.143     0.999939      1251823     16384.00
      14.295     0.999945      1251831     18204.44
      14.351     0.999951      1251838     20480.00
      14.447     0.999957      1251846     23405.71
      14.535     0.999963      1251854     27306.67
      14.607     0.999969      1251862     32768.00
      14.647     0.999973      1251865     36408.89
      14.687     0.999976      1251869     40960.00
      14.711     0.999979      1251873     46811.43
      14.759     0.999982      1251877     54613.33
      14.791     0.999985      1251881     65536.00
      14.799     0.999986      1251882     72817.78
      14.847     0.999988      1251884     81920.00
      14.903     0.999989      1251886     93622.86
      14.951     0.999991      1251889    109226.67
      15.031     0.999992      1251890    131072.00
      15.063     0.999993      1251891    145635.56
      15.079     0.999994      1251892    163840.00
      15.119     0.999995      1251894    187245.71
      15.119     0.999995      1251894    218453.33
      15.135     0.999996      1251895    262144.00
      15.135     0.999997      1251895    291271.11
      15.359     0.999997      1251896    327680.00
      15.359     0.999997      1251896    374491.43
      15.415     0.999998      1251897    436906.67
      15.415     0.999998      1251897    524288.00
      15.415     0.999998      1251897    582542.22
      15.423     0.999998      1251898    655360.00
      15.423     0.999999      1251898    748982.86
      15.423     0.999999      1251898    873813.33
      15.423     0.999999      1251898   1048576.00
      15.423     0.999999      1251898   1165084.44
      15.487     0.999999      1251899   1310720.00
      15.487     1.000000      1251899          inf
#[Mean    =        1.288, StdDeviation   =        0.769]
#[Max     =       15.480, Total count    =      1251899]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1898350 requests in 30.00s, 211.82MB read
Requests/sec:  63274.64
Transfer/sec:      7.06MB