benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-run4.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.288ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  692.08us   3.70ms   67.94%
    Req/Sec    67.32k     6.43k   78.22k    56.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.75ms
 90.000%    2.34ms
 99.000%    3.09ms
 99.900%    3.36ms
 99.990%    3.50ms
 99.999%    3.58ms
100.000%    3.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.515     0.100000       125393         1.11
       0.683     0.200000       250539         1.25
       0.835     0.300000       375665         1.43
       1.003     0.400000       501183         1.67
       1.189     0.500000       625995         2.00
       1.292     0.550000       688576         2.22
       1.397     0.600000       751320         2.50
       1.507     0.650000       813974         2.86
       1.625     0.700000       876436         3.33
       1.748     0.750000       939176         4.00
       1.812     0.775000       970357         4.44
       1.880     0.800000      1001492         5.00
       1.960     0.825000      1032976         5.71
       2.061     0.850000      1064508         6.67
       2.187     0.875000      1095762         8.00
       2.259     0.887500      1111350         8.89
       2.337     0.900000      1126953        10.00
       2.417     0.912500      1142282        11.43
       2.503     0.925000      1158178        13.33
       2.593     0.937500      1173858        16.00
       2.637     0.943750      1181423        17.78
       2.683     0.950000      1189243        20.00
       2.733     0.956250      1197152        22.86
       2.785     0.962500      1204959        26.67
       2.841     0.968750      1212852        32.00
       2.869     0.971875      1216654        35.56
       2.899     0.975000      1220627        40.00
       2.931     0.978125      1224631        45.71
       2.965     0.981250      1228514        53.33
       3.003     0.984375      1232407        64.00
       3.023     0.985938      1234266        71.11
       3.045     0.987500      1236265        80.00
       3.069     0.989062      1238213        91.43
       3.095     0.990625      1240160       106.67
       3.123     0.992188      1242098       128.00
       3.139     0.992969      1243059       142.22
       3.157     0.993750      1244062       160.00
       3.177     0.994531      1245027       182.86
       3.199     0.995313      1246033       213.33
       3.223     0.996094      1246997       256.00
       3.235     0.996484      1247424       284.44
       3.249     0.996875      1247903       320.00
       3.267     0.997266      1248428       365.71
       3.285     0.997656      1248926       426.67
       3.305     0.998047      1249373       512.00
       3.315     0.998242      1249622       568.89
       3.327     0.998437      1249895       640.00
       3.339     0.998633      1250108       731.43
       3.353     0.998828      1250376       853.33
       3.365     0.999023      1250587      1024.00
       3.373     0.999121      1250716      1137.78
       3.383     0.999219      1250850      1280.00
       3.391     0.999316      1250949      1462.86
       3.403     0.999414      1251082      1706.67
       3.415     0.999512      1251196      2048.00
       3.425     0.999561      1251254      2275.56
       3.435     0.999609      1251330      2560.00
       3.441     0.999658      1251379      2925.71
       3.451     0.999707      1251438      3413.33
       3.461     0.999756      1251499      4096.00
       3.465     0.999780      1251529      4551.11
       3.471     0.999805      1251566      5120.00
       3.477     0.999829      1251592      5851.43
       3.487     0.999854      1251634      6826.67
       3.491     0.999878      1251653      8192.00
       3.495     0.999890      1251670      9102.22
       3.501     0.999902      1251688     10240.00
       3.505     0.999915      1251701     11702.86
       3.509     0.999927      1251714     13653.33
       3.519     0.999939      1251734     16384.00
       3.521     0.999945      1251742     18204.44
       3.523     0.999951      1251743     20480.00
       3.533     0.999957      1251751     23405.71
       3.539     0.999963      1251761     27306.67
       3.545     0.999969      1251767     32768.00
       3.549     0.999973      1251771     36408.89
       3.555     0.999976      1251774     40960.00
       3.561     0.999979      1251780     46811.43
       3.563     0.999982      1251782     54613.33
       3.567     0.999985      1251785     65536.00
       3.575     0.999986      1251788     72817.78
       3.577     0.999988      1251791     81920.00
       3.577     0.999989      1251791     93622.86
       3.585     0.999991      1251793    109226.67
       3.591     0.999992      1251795    131072.00
       3.599     0.999993      1251796    145635.56
       3.613     0.999994      1251797    163840.00
       3.617     0.999995      1251798    187245.71
       3.621     0.999995      1251799    218453.33
       3.647     0.999996      1251801    262144.00
       3.647     0.999997      1251801    291271.11
       3.647     0.999997      1251801    327680.00
       3.647     0.999997      1251801    374491.43
       3.655     0.999998      1251802    436906.67
       3.655     0.999998      1251802    524288.00
       3.655     0.999998      1251802    582542.22
       3.659     0.999998      1251803    655360.00
       3.659     0.999999      1251803    748982.86
       3.659     0.999999      1251803    873813.33
       3.659     0.999999      1251803   1048576.00
       3.659     0.999999      1251803   1165084.44
       3.697     0.999999      1251804   1310720.00
       3.697     1.000000      1251804          inf
#[Mean    =        1.310, StdDeviation   =        0.692]
#[Max     =        3.696, Total count    =      1251804]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1898242 requests in 30.00s, 211.81MB read
Requests/sec:  63274.40
Transfer/sec:      7.06MB